Repository: Kniyl/Drone-Racer
Catalog: drone_racer/*/LC_MESSAGES/cli.po
Languages: fr

source: "Drone Racer"'s Graphical User Interface
fr: Interface graphique "Drone Racer"

source: Use a fancier (Gtk3 like) titlebar for the GUI
fr: Utilise une barre de titre un peu plus Gtk3

source: List off all communication channels to get data from the gates. If none is selected, data will be read from stdin.
fr: Liste des moyens de communication permettant de recevoir les données des portes. Si aucun module de communication n’est sélectionné, les données sont lues sur l’entrée standard.

source: More options are available per channel
fr: Des options supplémentaires sont disponibles par module

source: Communication through XBee frames
fr: Envoi de trames XBee

source: Serial file mapped to the XBee pins
fr: Spécifie le port série à utiliser pour récupérer les informations provenant du XBee

source: Switch indicating wether it is an XBee or a ZigBee
fr: Spécifie si le module XBee est un ZigBee

source: Serial port communication speed
fr: Débit du port série utilisé pour la connexion avec le module XBee

source: Communication through UDP datagrams
fr: Envoi de datagrammes UDP

source: Socket port to listen on
fr: Port à utiliser pour l’écoute UDP
