Repository: Kniyl/Drone-Racer
Catalog: drone_racer/*/LC_MESSAGES/utils.po
Languages: fr

source: Race ongoing. Stop it or wait for its end
fr: Une course est déjà en cours. Attendez sa fin ou forcez son arrêt.

source: Cancelation failed: no race setup
fr: Aucune course n’a été configurée. Impossible d’annuler.

source: Can not start race: no race setup
fr: Impossible de démarrer : aucune course configurée

source: No race to stop
fr: Il n’y a pas de course démarrée.

source: This drone flew for only {} rounds. Can not modify the first one.
fr: Ce drone n’a fait que {} tours. Impossible de modifier le premier.

source: Strict mode was specified: time for the race is missing.
fr: Un temps de course doit être défini lorsque l’option stricte est activée

source: Too much starting gates specified
fr: Trop de portes de départ

source: Only one finish line must be specified
fr: Une (et une seule) ligne d’arrivée doit être définie

source: The gate following gate "{0}" is set to "{1}" but gate "{1}" does not exist
fr: La porte suivant la porte "{0}" a été définie à "{1}" mais la porte "{1}" n’existe pas

source: There is no finish line in unordered mode
fr: Une porte d’arrivée n’a pas de sens dans un contexte où les portes ne sont pas ordonnées

source: REST request {} failed:
fr: La requete REST {} a échoué :

source: Corrupted database encountered. Aborting.
fr: La base de donnée est corrompue. Abandon.

source: No event loaded; can not retrieve associated games.
fr: Vous n’avez pas chargé d’évènement. Impossible de voir les jeux associés.

source: No event loaded; can not register a new race
fr: Vous n’avez pas chargé d’évènement. Impossible d’enregistrer une course.

source: Database creation failed: file already exists
fr: Une base de donnée ne peut pas être créée car le fichier existe déjà

source: Opening database failed: no such file
fr: La base de donnée ne peut pas être ouverte car le fichier n’existe pas

source: Subclasses must implement this method
fr: Les clases dérivées doivent implémenter cette méthode

source: Received unparsable message: {}
fr: Le message {} a été reçu mais n’est pas compris par l’application.

source: Can not load XBee module. No data will be received
fr: Le module XBee est introuvable. Aucune donnée ne pourra àtre lue.

source: Received empty frame
fr: Un message ne contenant pas de données a été reçu
